Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: One of the easiest ways to contribute to L<Mojolicious> is through documentation improvements.
ja: One of the easiest ways to contribute to [[Mojolicious]] is through documentation improvements.

source: One of the main differences between L<Mojolicious> and other web frameworks is that it also includes L<Mojolicious::Lite>, a micro web framework optimized for rapid prototyping.
ja: One of the main differences between [[Mojolicious]] and other web frameworks is that it also includes [[Mojolicious::Lite]], a micro web framework optimized for rapid prototyping.

source: One of the most popular setups these days is L<Hypnotoad|Mojo::Server::Hypnotoad> behind an L<Nginx|http://nginx.org> reverse proxy, which even supports WebSockets in newer versions.
ja: One of the most popular setups these days is [[Hypnotoad|Mojo::Server::Hypnotoad]] behind an [[Nginx|http://nginx.org]] reverse proxy, which even supports WebSockets in newer versions.

source: Only L<Mojo::ByteStream> objects are excluded from automatic escaping.
ja: Only [[Mojo::ByteStream]] objects are excluded from automatic escaping.

source: Open a TCP/IP or UNIX domain socket connection with L<Mojo::IOLoop::Client> and create a stream object (usually L<Mojo::IOLoop::Stream>), takes the same arguments as L<Mojo::IOLoop::Client/"connect">.
ja: Open a TCP/IP or UNIX domain socket connection with [[Mojo::IOLoop::Client]] and create a stream object (usually [[Mojo::IOLoop::Stream]]), takes the same arguments as [[Mojo::IOLoop::Client/"connect"]].

source: Open a WebSocket connection with transparent handshake, takes the same arguments as L<Mojo::UserAgent/"websocket">, except for the callback.
ja: Open a WebSocket connection with transparent handshake, takes the same arguments as [[Mojo::UserAgent/"websocket"]], except for the callback.

source: Open a non-blocking WebSocket connection with transparent handshake, takes the same arguments as L<Mojo::UserAgent::Transactor/"websocket">.
ja: Open a non-blocking WebSocket connection with transparent handshake, takes the same arguments as [[Mojo::UserAgent::Transactor/"websocket"]].

source: Open file with L<IO::File>.
ja: Open file with [[IO::File]].

source: Opposite of L</"content_is">.
ja: Opposite of [[/"content_is"]].

source: Opposite of L</"content_like">.
ja: Opposite of [[/"content_like"]].

source: Opposite of L</"content_type_is">.
ja: Opposite of [[/"content_type_is"]].

source: Opposite of L</"content_type_like">.
ja: Opposite of [[/"content_type_like"]].

source: Opposite of L</"element_exists">.
ja: Opposite of [[/"element_exists"]].

source: Opposite of L</"header_is">.
ja: Opposite of [[/"header_is"]].

source: Opposite of L</"header_like">.
ja: Opposite of [[/"header_like"]].

source: Opposite of L</"json_has">.
ja: Opposite of [[/"json_has"]].

source: Opposite of L</"json_like">.
ja: Opposite of [[/"json_like"]].

source: Opposite of L</"json_message_has">.
ja: Opposite of [[/"json_message_has"]].

source: Opposite of L</"json_message_like">.
ja: Opposite of [[/"json_message_like"]].

source: Opposite of L</"message_is">.
ja: Opposite of [[/"message_is"]].

source: Opposite of L</"message_like">.
ja: Opposite of [[/"message_like"]].

source: Opposite of L</"status_is">.
ja: Opposite of [[/"status_is"]].

source: Opposite of L</"text_is">.
ja: Opposite of [[/"text_is"]].

source: Opposite of L</"text_like">.
ja: Opposite of [[/"text_like"]].

source: Or if you don't actually need zero downtime software upgrades, just use L<Mojolicious::Command::prefork> instead, which is otherwise almost identical to Hypnotoad.
ja: Or if you don't actually need zero downtime software upgrades, just use [[Mojolicious::Command::prefork]] instead, which is otherwise almost identical to Hypnotoad.

source: Or just add a C<hypnotoad> section to your L<Mojolicious::Plugin::Config> or L<Mojolicious::Plugin::JSONConfig> configuration file.
ja: Or just add a C<hypnotoad> section to your [[Mojolicious::Plugin::Config> or [[Mojolicious::Plugin::JSONConfig]] configuration file.

source: Or perform quick requests right from the command line with L<Mojolicious::Command::get>.
ja: Or perform quick requests right from the command line with [[Mojolicious::Command::get]].

source: Or you can just disable format detection with a special type of restrictive placeholder.
ja: フォーマットの検知は、特別なタイプのプレースホルダーを使うことで無効にすることもできます。

source: Other guides delve deeper into topics like L<growing|Mojolicious::Guides::Growing> a L<Mojolicious::Lite> prototype into a well-structured L<Mojolicious> application, L<routing|Mojolicious::Guides::Routing>, L<rendering|Mojolicious::Guides::Rendering> and more.
ja: その他のガイドでは、各トピックについて深堀します。たとえば、[[Mojolicious::Lite]]のプロトタイプをしっかり構築した[[Mojolicious]] アプリケーションに育てるための[[growing|Mojolicious::Guides::Growing]]や[[routing|Mojolicious::Guides::Routing]]、 [[rendering|Mojolicious::Guides::Rendering]]、その他にもたくさんあります。

source: Our templates are using quite a few features of the renderer, L<Mojolicious::Guides::Rendering> explains them all in great detail.
ja: Our templates are using quite a few features of the renderer, [[Mojolicious::Guides::Rendering]] explains them all in great detail.

source: Parse HTML/XML fragment with L<Mojo::DOM::HTML>.
ja: Parse HTML/XML fragment with [[Mojo::DOM::HTML]].

source: Parse content chunk and upgrade to L<Mojo::Content::MultiPart> object if necessary.
ja: Parse content chunk and upgrade to [[Mojo::Content::MultiPart]] object if necessary.

source: Parse template into L</"tree">.
ja: Parse template into [[/"tree"]].

source: Password part of L</"userinfo">.
ja: Password part of [[/"userinfo"]].

source: Path part of this URL, relative paths will be merged with L<Mojo::Path/"merge">, defaults to a L<Mojo::Path> object.
ja: Path part of this URL, relative paths will be merged with [[Mojo::Path/"merge"]], defaults to a [[Mojo::Path]] object.

source: Paths for extra files to be served from locations other than L</"paths">, such as the images used by the built-in exception and not found pages.
ja: Paths for extra files to be served from locations other than [[/"paths"]], such as the images used by the built-in exception and not found pages.

source: Pattern for this route, defaults to a L<Mojolicious::Routes::Pattern> object.
ja: Pattern for this route, defaults to a [[Mojolicious::Routes::Pattern]] object.

source: Percent encode all unsafe characters in bytestream with L<Mojo::Util/"url_escape">.
ja: Percent encode all unsafe characters in bytestream with [[Mojo::Util/"url_escape"]].

source: Percent encode unsafe characters in string as described in L<RFC 3986|http://tools.ietf.org/html/rfc3986>, the pattern used defaults to C<^A-Za-z0-9\-._~>.
ja: Percent encode unsafe characters in string as described in [[RFC 3986|http://tools.ietf.org/html/rfc3986]], the pattern used defaults to C<^A-Za-z0-9\-._~>.

source: Perform a C<DELETE> request and check for transport errors, takes the same arguments as L<Mojo::UserAgent/"delete">, except for the callback.
ja: Perform a C<DELETE> request and check for transport errors, takes the same arguments as [[Mojo::UserAgent/"delete"]], except for the callback.

source: Perform a C<GET> request and check for transport errors, takes the same arguments as L<Mojo::UserAgent/"get">, except for the callback.
ja: Perform a C<GET> request and check for transport errors, takes the same arguments as [[Mojo::UserAgent/"get"]], except for the callback.

source: Perform a C<HEAD> request and check for transport errors, takes the same arguments as L<Mojo::UserAgent/"head">, except for the callback.
ja: Perform a C<HEAD> request and check for transport errors, takes the same arguments as [[Mojo::UserAgent/"head"]], except for the callback.

source: Perform a C<OPTIONS> request and check for transport errors, takes the same arguments as L<Mojo::UserAgent/"options">, except for the callback.
ja: Perform a C<OPTIONS> request and check for transport errors, takes the same arguments as [[Mojo::UserAgent/"options"]], except for the callback.

source: Perform a C<PATCH> request and check for transport errors, takes the same arguments as L<Mojo::UserAgent/"patch">, except for the callback.
ja: Perform a C<PATCH> request and check for transport errors, takes the same arguments as [[Mojo::UserAgent/"patch"]], except for the callback.

source: Perform a C<POST> request and check for transport errors, takes the same arguments as L<Mojo::UserAgent/"post">, except for the callback.
ja: Perform a C<POST> request and check for transport errors, takes the same arguments as [[Mojo::UserAgent/"post"]], except for the callback.

source: Perform a C<PUT> request and check for transport errors, takes the same arguments as L<Mojo::UserAgent/"put">, except for the callback.
ja: Perform a C<PUT> request and check for transport errors, takes the same arguments as [[Mojo::UserAgent/"put"]], except for the callback.

source: Perform blocking C<DELETE> request and return resulting L<Mojo::Transaction::HTTP> object, takes the same arguments as L<Mojo::UserAgent::Transactor/"tx"> (except for the C<DELETE> method, which is implied).
ja: Perform blocking C<DELETE> request and return resulting [[Mojo::Transaction::HTTP]] object, takes the same arguments as [[Mojo::UserAgent::Transactor/"tx"]] (except for the C<DELETE> method, which is implied).

source: Perform blocking C<GET> request and return resulting L<Mojo::Transaction::HTTP> object, takes the same arguments as L<Mojo::UserAgent::Transactor/"tx"> (except for the C<GET> method, which is implied).
ja: Perform blocking C<GET> request and return resulting [[Mojo::Transaction::HTTP> object, takes the same arguments as [[Mojo::UserAgent::Transactor/"tx"]] (except for the C<GET> method, which is implied).

source: Perform blocking C<HEAD> request and return resulting L<Mojo::Transaction::HTTP> object, takes the same arguments as L<Mojo::UserAgent::Transactor/"tx"> (except for the C<HEAD> method, which is implied).
ja: Perform blocking C<HEAD> request and return resulting [[Mojo::Transaction::HTTP]] object, takes the same arguments as [[Mojo::UserAgent::Transactor/"tx"]] (except for the C<HEAD> method, which is implied).

source: Perform blocking C<OPTIONS> request and return resulting L<Mojo::Transaction::HTTP> object, takes the same arguments as L<Mojo::UserAgent::Transactor/"tx"> (except for the C<OPTIONS> method, which is implied).
ja: Perform blocking C<OPTIONS> request and return resulting [[Mojo::Transaction::HTTP]] object, takes the same arguments as [[Mojo::UserAgent::Transactor/"tx"]] (except for the C<OPTIONS> method, which is implied).

source: Perform blocking C<PATCH> request and return resulting L<Mojo::Transaction::HTTP> object, takes the same arguments as L<Mojo::UserAgent::Transactor/"tx"> (except for the C<PATCH> method, which is implied).
ja: Perform blocking C<PATCH> request and return resulting [[Mojo::Transaction::HTTP]] object, takes the same arguments as [[Mojo::UserAgent::Transactor/"tx"]] (except for the C<PATCH> method, which is implied).

source: Perform blocking C<POST> request and return resulting L<Mojo::Transaction::HTTP> object, takes the same arguments as L<Mojo::UserAgent::Transactor/"tx"> (except for the C<POST> method, which is implied).
ja: Perform blocking C<POST> request and return resulting [[Mojo::Transaction::HTTP]] object, takes the same arguments as [[Mojo::UserAgent::Transactor/"tx"]] (except for the C<POST> method, which is implied).

source: Perform blocking C<PUT> request and return resulting L<Mojo::Transaction::HTTP> object, takes the same arguments as L<Mojo::UserAgent::Transactor/"tx"> (except for the C<PUT> method, which is implied).
ja: Perform blocking C<PUT> request and return resulting [[Mojo::Transaction::HTTP> object, takes the same arguments as [[Mojo::UserAgent::Transactor/"tx"]] (except for the C<PUT> method, which is implied).

source: Perform blocking request for a custom L<Mojo::Transaction::HTTP> object, which can be prepared manually or with L</"build_tx">.
ja: Perform blocking request for a custom [[Mojo::Transaction::HTTP]] object, which can be prepared manually or with [[/"build_tx"]].

source: Perform queries blocking and non-blocking, use all L<SQL features|https://www.postgresql.org/docs/current/static/sql.html> PostgreSQL has to offer, generate CRUD queries from data structures, manage your database schema with migrations and build scalable real-time web applications with the publish/subscribe pattern.
ja: Perform queries blocking and non-blocking, use all [[SQL features|https://www.postgresql.org/docs/current/static/sql.html]] PostgreSQL has to offer, generate CRUD queries from data structures, manage your database schema with migrations and build scalable real-time web applications with the publish/subscribe pattern.

source: Perform validation check on all values of the current L</"topic">, no more checks will be performed on them after the first one failed.
ja: Perform validation check on all values of the current [[/"topic"]], no more checks will be performed on them after the first one failed.

source: Persistent data storage for the next few requests, all session data gets serialized with L<Mojo::JSON> and stored Base64 encoded in HMAC-SHA1 signed cookies, to prevent tampering.
ja: Persistent data storage for the next few requests, all session data gets serialized with [[Mojo::JSON]] and stored Base64 encoded in HMAC-SHA1 signed cookies, to prevent tampering.

source: Please refer to the L<Test::Mojo> documentation for a complete reference to many of the ideas and syntax introduced in this document.
ja: Please refer to the [[Test::Mojo]] documentation for a complete reference to many of the ideas and syntax introduced in this document.

source: Portably render a template with L</"render_data"> to a file relative to the current working directory if it does not exist already, and create the directory if necessary.
ja: Portably render a template with [[/"render_data"]] to a file relative to the current working directory if it does not exist already, and create the directory if necessary.

source: Powerful yet elegant testing techniques and tools for L<Mojolicious> and other web applications.
ja: Powerful yet elegant testing techniques and tools for [[Mojolicious]] and other web applications.

source: Prefixing multiple routes is another good use for it.
ja: 複数のルーティングをあらかじめ決めるために使うのもまた良い利用方法です。

source: Prepare a C<302> (if the status code is not already C<3xx>) redirect response with C<Location> header, takes the same arguments as L</"url_for">.
ja: Prepare a C<302> (if the status code is not already C<3xx>) redirect response with C<Location> header, takes the same arguments as [[/"url_for">.

source: Prepare static files from L</"classes"> for future use.
ja: Prepare static files from [[/"classes"]] for future use.

source: Prepare templates from L</"classes"> for future use.
ja: Prepare templates from [[/"classes"]] for future use.

source: Previous transaction that triggered this follow-up transaction, usually a L<Mojo::Transaction::HTTP> object.
ja: Previous transaction that triggered this follow-up transaction, usually a [[Mojo::Transaction::HTTP]] object.

source: Process configuration file with L<Mojo::Template>.
ja: Process configuration file with [[Mojo::Template]].

source: Process content with L</"render"> and parse it with L<Mojo::JSON>.
ja: Process content with [[/"render"]] and parse it with [[Mojo::JSON]].

source: Process previously parsed template and return the result, or a L<Mojo::Exception> object if rendering failed.
ja: Process previously parsed template and return the result, or a [[Mojo::Exception]] object if rendering failed.

source: Promises have three states, they start out as C<pending> and you call L<Mojo::Promise/"resolve"> to transition them to C<fulfilled>, or L<Mojo::Promise/"reject"> to transition them to C<rejected>.
ja: Promises have three states, they start out as C<pending> and you call [[Mojo::Promise/"resolve"]] to transition them to C<fulfilled>, or [[Mojo::Promise/"reject"]] to transition them to C<rejected>.

source: Proxy manager, defaults to a L<Mojo::UserAgent::Proxy> object.
ja: Proxy manager, defaults to a [[Mojo::UserAgent::Proxy]] object.

source: Pull requests with additions or changes to the documentation included in the L<Mojolicious> distribution follow the same rules as code contributions.
ja: Pull requests with additions or changes to the documentation included in the [[Mojolicious]] distribution follow the same rules as code contributions.

source: Punycode decode bytestream with L<Mojo::Util/"punycode_decode">.
ja: Punycode decode bytestream with [[Mojo::Util/"punycode_decode"]].

source: Punycode decode string as described in L<RFC 3492|http://tools.ietf.org/html/rfc3492>.
ja: Punycode decode string as described in [[RFC 3492|http://tools.ietf.org/html/rfc3492]].

source: Punycode encode bytestream with L<Mojo::Util/"punycode_encode">.
ja: Punycode encode bytestream with [[Mojo::Util/"punycode_encode"]].

source: Punycode encode string as described in L<RFC 3492|http://tools.ietf.org/html/rfc3492>.
ja: Punycode encode string as described in [[RFC 3492|http://tools.ietf.org/html/rfc3492]].

source: Query part of this URL, key/value pairs in an array reference will be appended with L<Mojo::Parameters/"append">, and key/value pairs in a hash reference merged with L<Mojo::Parameters/"merge">, defaults to a L<Mojo::Parameters> object.
ja: Query part of this URL, key/value pairs in an array reference will be appended with [[Mojo::Parameters/"append"]], and key/value pairs in a hash reference merged with [[Mojo::Parameters/"merge"]], defaults to a [[Mojo::Parameters]] object.

source: Quote bytestream with L<Mojo::Util/"quote">.
ja: Quote bytestream with [[Mojo::Util/"quote"]].

source: Read data client-side, used to implement user agents such as L<Mojo::UserAgent>.
ja: Read data client-side, used to implement user agents such as [[Mojo::UserAgent]].

source: Read data server-side, used to implement web servers such as L<Mojo::Server::Daemon>.
ja: Read data server-side, used to implement web servers such as [[Mojo::Server::Daemon]].

source: Receive messages just by subscribing to events such as L<Mojo::Transaction::WebSocket/"message"> with L<Mojolicious::Controller/"on"> and return them with L<Mojolicious::Controller/"send">.
ja: Receive messages just by subscribing to events such as [[Mojo::Transaction::WebSocket/"message"]] with [[Mojolicious::Controller/"on"]] and return them with [[Mojolicious::Controller/"send"]].

source: Receiving a streaming response can be really tricky in most HTTP clients, but L<Mojo::UserAgent> makes it actually easy.
ja: Receiving a streaming response can be really tricky in most HTTP clients, but [[Mojo::UserAgent]] makes it actually easy.

source: Recurring timers created with L<Mojo::IOLoop/"recurring"> are slightly more powerful, but need to be stopped manually, or they would just keep getting emitted.
ja: Recurring timers created with [[Mojo::IOLoop/"recurring"]] are slightly more powerful, but need to be stopped manually, or they would just keep getting emitted.

source: Register conditions in L<Mojolicious> application.
ja: Register conditions in [[Mojolicious]] application.

source: Register helpers in L<Mojolicious> application.
ja: Register helpers in [[Mojolicious]] application.

source: Register plugin in L<Mojolicious> application and merge configuration.
ja: Register plugin in [[Mojolicious]] application and merge configuration.

source: Register plugin in L<Mojolicious> application.
ja: Register plugin in [[Mojolicious]] application.

source: Register renderer in L<Mojolicious> application.
ja: Register renderer in [[Mojolicious]] application.

source: Registered placeholder types, by default only L</"num"> is already defined.
ja: Registered placeholder types, by default only [[/"num"]] is already defined.

source: Registered validation checks, by default only L</"equal_to">, L</"in">, L</"like">, L</"num">, L</"size"> and L</"upload"> are already defined.
ja: Registered validation checks, by default only [[/"equal_to"]], [[/"in"]], [[/"like"]], [[/"num"]], [[/"size"]] and [[/"upload"]] are already defined.

source: Relative URLs in the test object method assertions (C<get_ok>, C<post_ok>, etc.) will be sent to the Mojolicious application started by L<Test::Mojo>:
ja: Relative URLs in the test object method assertions (C<get_ok>, C<post_ok>, etc.) will be sent to the Mojolicious application started by [[Test::Mojo]]:

source: Relaxed placeholders allow matching of everything until a C</> occurs, similar to the regular expression C<([^/]+)>.
ja: リラックスプレースホルダーを使えば、 C</>が出現するまでのすべてにマッチさせることができます。これは正規表現のC<([^/]+)>に似ています。

source: Remove this element while preserving its content and return L</"parent">.
ja: Remove this element while preserving its content and return [[/"parent"]].

source: Remove this node and return L</"root"> (for C<root> nodes) or L</"parent">.
ja: Remove this node and return [[/"root"]] (for C<root]] nodes) or L</"parent">.

source: Render L<RFC 3339|http://tools.ietf.org/html/rfc3339> date and time.
ja: Render [[RFC 3339|http://tools.ietf.org/html/rfc3339]] date and time.

source: Render a template from the C<DATA> section of the command class with L<Mojo::Loader> and L<Mojo::Template>.
ja: Render a template from the C<DATA> section of the command class with [[Mojo::Loader]] and [[Mojo::Template]].

source: Render a template with L</"render_data"> to a file if it does not exist already, and create the directory if necessary.
ja: Render a template with [[/"render_data"]] to a file if it does not exist already, and create the directory if necessary.

source: Render all headers with L</"get_header_chunk">.
ja: Render all headers with [[/"get_header_chunk"]].

source: Render content with L<Mojolicious/"renderer"> and emit hooks L<Mojolicious/"before_render"> as well as L<Mojolicious/"after_render">, or call L<Mojolicious::Plugin::DefaultHelpers/"reply-E<gt>not_found"> if no response could be generated, all additional key/value pairs get merged into the L</"stash">.
ja: Render content with [[Mojolicious/"renderer"]] and emit hooks [[Mojolicious/"before_render"]] as well as [[Mojolicious/"after_render"]], or call [[Mojolicious::Plugin::DefaultHelpers/"reply-E<gt]]not_found"]] if no response could be generated, all additional key/value pairs get merged into the [[/"stash"]].

source: Render start-line with L</"get_start_line_chunk">.
ja: Render start-line with [[/"get_start_line_chunk"]].

source: Render template and return the result, or a L<Mojo::Exception> object if rendering failed.
ja: Render template and return the result, or a [[Mojo::Exception]] object if rendering failed.

source: Render whole body with L</"get_body_chunk">.
ja: Render whole body with [[/"get_body_chunk"]].

source: Renderer cache, defaults to a L<Mojo::Cache> object.
ja: Renderer cache, defaults to a [[Mojo::Cache]] object.

source: Replace this node with HTML/XML fragment and return L</"root"> (for C<root> nodes) or L</"parent">.
ja: Replace this node with HTML/XML fragment and return [[/"root"]] (for C<root> nodes) or [[/"parent"]].

source: Reply with a L<Mojo::Asset::File> or L<Mojo::Asset::Memory> object using L<Mojolicious::Static/"serve_asset">, and perform content negotiation with C<Range>, C<If-Modified-Since> and C<If-None-Match> headers.
ja: Reply with a [[Mojo::Asset::File]] or [[Mojo::Asset::Memory]] object using [[Mojolicious::Static/"serve_asset"]], and perform content negotiation with C<Range>, C<If-Modified-Since> and C<If-None-Match> headers.

source: Reply with a static file from an absolute path anywhere on the file system using L<Mojolicious/"static">.
ja: Reply with a static file from an absolute path anywhere on the file system using [[Mojolicious/"static"]].
